package task_3;

public class OracleAnonymousClass {
    /**
     * Oracle
     * Анонімні класи: https://docs.oracle.com/javase/tutorial/java/javaOO/anonymousclasses.html
     * Анонімний клас (anonymous class) – це локальний клас без імені.
     * Основне обмеження під час використання анонімних класів – це неможливість опису конструктора, оскільки
     * клас немає імені. Аргументи, вказані у дужках, автоматично використовуються для виклику конструктора базового
     * класу з тими самими параметрами.
     * Анонімні класи мають ті самі обмеження, що й локальні.
     * Використання анонімних класів виправдане у багатьох випадках, зокрема коли:
     * 1) тіло класу є дуже коротким;
     * 2) потрібен лише один екземпляр класу;
     * 3) клас використовується у місці його створення або відразу після нього;
     * 4) ім'я класу не є важливим і не полегшує розуміння коду.
     */
}
